code-review/NRB_3471_3546/База_Было/Documents/ОперацияСДенежнымиСредствами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОперацияСДенежнымиСредствами</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
				<xr:Item>Document.ПогашениеНКД</xr:Item>
				<xr:Item>Document.ПогашениеЦБ</xr:Item>
				<xr:Item>Document.ПогашениеЦБЧастичное</xr:Item>
				<xr:Item>Document.ПогашениеЦБПолное</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийНеограниченнойДлины</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ГлобальнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеНКД</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБПолное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБЧастичное</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДивидендов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Выплата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ОперацияСДенежнымиСредствами/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ДенежныеСредства.Записывать = Истина;
	Движения.ДенежныеСредства.Очистить();
	
	Движение = Движения.ДенежныеСредства.ДобавитьРасход();
	Движение.Период			= Дата;
	Движение.БанковскийСчет	= БанковскийСчет;
	Движение.Депонент		= Депонент;
	Движение.Валюта			= Валюта;
	Движение.Сумма			= Сумма;
	Движение.ВалютнаяСумма	= Сумма;
	
	Движения.ДенежныеСредства.Записать();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДенежныеСредстваОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(
	|			,
	|			БанковскийСчет = &БанковскийСчет
	|				И Валюта = &Валюта
	|				И Депонент = &Депонент) КАК ДенежныеСредстваОстатки
	|ГДЕ
	|	ДенежныеСредстваОстатки.СуммаОстаток < 0");
	
	Запрос.УстановитьПараметр("БанковскийСчет"	, БанковскийСчет);
	Запрос.УстановитьПараметр("Валюта"			, Валюта);
	Запрос.УстановитьПараметр("Депонент"		, Депонент);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Образован отрицательный остаток ДС по счету " + БанковскийСчет + ". Операция не выполнена!";
		Сообщение.Поле = "";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВводДивидендов") Тогда
		Основание		= ДанныеЗаполнения;
		БанковскийСчет	= ДанныеЗаполнения.БанковскийСчет;
		Валюта			= БанковскийСчет.ВалютаДенежныхСредств;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПогашениеНКД") ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПогашениеЦБПолное") ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПогашениеЦБЧастичное") Тогда
		Основание		= ДанныеЗаполнения;
		БанковскийСчет	= ДанныеЗаполнения.ДокументОснование.БанковскийСчет;
		Валюта			= БанковскийСчет.ВалютаДенежныхСредств;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ГлобальнаяОперация") Тогда
		Основание		= ДанныеЗаполнения;
		БанковскийСчет	= ДанныеЗаполнения.БанковскийСчет;
		Валюта			= БанковскийСчет.ВалютаДенежныхСредств;
	Иначе
		Основание		= ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
